In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../data/raw/DataAnalyst.csv')

In [4]:
f = df.drop('Unnamed: 0',axis=1)

In [5]:
f = df

In [6]:
f = f[['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Industry', 'Sector', 'Revenue', 'Easy Apply']]

In [7]:
f.columns = map(str.lower,f.columns)

In [8]:
f.columns = f.columns.str.replace(' ','_')

In [9]:
f[~f['salary_estimate'].str.contains('Glassdoor est.')]

,job_title,salary_estimate,job_description,rating,company_name,location,industry,sector,revenue,easy_apply
2149,Configuration/Data Management Analyst III,-1,Job Description\nPosition Title: Configuration...,4.4,Protingent\n4.4,"Kent, WA",Staffing & Outsourcing,Business Services,$25 to $50 million (USD),-1

In [10]:
f = f.drop(2149)

In [11]:
f['salary_estimate'] = f['salary_estimate'].str.replace('\(Glassdoor est.\)','')

In [12]:
f['salary_estimate'] = f['salary_estimate'].str.replace('$','').str.replace('K','000')

In [13]:
f['low_salary'] = f['salary_estimate'].str.split('-').str.get(0)
f['high_salary'] = f['salary_estimate'].str.split('-').str.get(1)

In [14]:
f.drop('salary_estimate',axis=1,inplace=True)

In [15]:
f['low_salary']  = pd.to_numeric(f['low_salary'] )

In [16]:
f['high_salary']  = pd.to_numeric(f['high_salary'] )

In [17]:
f['mid_salary'] = ( f['low_salary'] + f['low_salary'] )/2

In [18]:
f = f[['job_title', 'low_salary',
    'mid_salary','high_salary',
   'job_description', 'rating', 'company_name', 'location',
     'easy_apply', ]]

In [19]:
#create job_id column that matches index to keep track of job allowing later merges of different views
f = f.reset_index()

f.rename(columns={'index':'job_id'},inplace=True)

In [20]:
f['city'] = f['location'].str.split(', ').str.get(0)
f['state'] = f['location'].str.split(', ').str.get(-1)

In [21]:
f

,job_id,job_title,low_salary,mid_salary,high_salary,job_description,rating,company_name,location,easy_apply,city,state
0,0,"Data Analyst, Center on Immigration and Justic...",37000,37000.0,66000,Are you eager to roll up your sleeves and harn...,3.2,Vera Institute of Justice\n3.2,"New York, NY",True,New York,NY
1,1,Quality Data Analyst,37000,37000.0,66000,Overview\n\nProvides analytical and technical ...,3.8,Visiting Nurse Service of New York\n3.8,"New York, NY",-1,New York,NY
2,2,"Senior Data Analyst, Insights & Analytics Team...",37000,37000.0,66000,We’re looking for a Senior Data Analyst who ha...,3.4,Squarespace\n3.4,"New York, NY",-1,New York,NY
3,3,Data Analyst,37000,37000.0,66000,Requisition NumberRR-0001939\nRemote:Yes\nWe c...,4.1,Celerity\n4.1,"New York, NY",-1,New York,NY
4,4,Reporting Data Analyst,37000,37000.0,66000,ABOUT FANDUEL GROUP\n\nFanDuel Group is a worl...,3.9,FanDuel\n3.9,"New York, NY",True,New York,NY
...,...,...,...,...,...,...,...,...,...,...,...,...
2247,2248,RQS - IHHA - 201900004460 -1q Data Security An...,78000,78000.0,104000,Maintains systems to protect data from unautho...,2.5,"Avacend, Inc.\n2.5","Denver, CO",-1,Denver,CO
2248,2249,Senior Data Analyst (Corporate Audit),78000,78000.0,104000,Position:\nSenior Data Analyst (Corporate Audi...,2.9,Arrow Electronics\n2.9,"Centennial, CO",-1,Centennial,CO
2249,2250,"Technical Business Analyst (SQL, Data analytic...",78000,78000.0,104000,"Title: Technical Business Analyst (SQL, Data a...",-1.0,Spiceorb,"Denver, CO",-1,Denver,CO
2250,2251,"Data Analyst 3, Customer Experience",78000,78000.0,104000,Summary\n\nResponsible for working cross-funct...,3.1,Contingent Network Services\n3.1,"Centennial, CO",-1,Centennial,CO
2251,2252,Senior Quality Data Analyst,78000,78000.0,104000,"You.\n\nYou bring your body, mind, heart and s...",3.4,SCL Health\n3.4,"Broomfield, CO",-1,Broomfield,CO

In [22]:
# f = f.drop('location',axis=1)

In [23]:
f = f.drop('job_id',axis=True)

In [24]:
f['company_name'] = f['company_name'].str.split('\n').str.get(0)

In [25]:
f.to_pickle('../data/interim/data_analyst.pkl')